<#-- 1.测试if --> 
<#if  num  lt  18> ${num}岁以下，属于未成年人！   </#if>
========================================

<#-- 2.测试if  else  -->
<#if num  &lt;  18> ${num}岁以下，属于未成年人！ 
<#else >            ${num}岁以上，属于成年人！ 
</#if>
========================================

<#-- 3.测试 if elseif  elseif  else -->
<#if num  lt  18>                        ${num}岁以下，属于未成年人！ 
<#elseif num gte 18  &&  num lt  50   >  ${num}岁以上，属于成年人！
<#elseif num gte 50>   ${num}岁以上，属于老年人！
</#if>
========================================


<#-- 3.测试 list ,其中有两个特殊的变量可以引用   var+"_index"  索引，计算器，   var+"_has_next" 判断是否有下一列 -->  
<#assign x=0>  
<#list sexList  as  tmp >
	<#assign x = x + 1>
    ${x}; <br>${tmp_index}<#--特殊变量索引 -->=====${tmp}===== <#if !tmp_has_next >是最后一列</#if></br>
    <#break>   <#-- 终止循环-->
</#list>
===========================================

<#--包含文件-->
<#include "hello.txt" />  
===========================================

<#--自定义宏指令: hello为指令的名称-->
<#macro  hello>
	<hello>123<hello>
	<br>${num}</br>
</#macro>
===========================================
<@hello/>  <#--调用自定义宏指令“hello”-->

<#--自定义有参数的宏指令: hello为指令的名称 (参数用空格隔开 不需要指定类型会自动转换)-->
<#macro  showMessage a b c>
  <br>  ${a}---${b}---${c}
</#macro>
===========================================
<@showMessage a="zhangsan"  b=zmy c="${zmy}"/>  <#--调用自定义宏指令“showMessage” ,其中c的值为页面传过去的-->


=================================
<#--命名空间指令 -->



